# Отчёт по лабораторной работе №15 по курсу “Фундаментальная информатика”

Студент группы: М80-108Б-22 Горюнов Даниил Владимирович, № по списку 4 

Контакты e-mail: dania.goryunow2013@yandex.ru

Работа выполнена: «10» декабря 2022 г.

Преподаватель: асп. каф. 806 Сахарин Никита Александрович

Входной контроль знаний с оценкой _______________________

Отчет сдан «10» декабря 2022 г., итоговая оценка ______

Подпись преподавателя ___________


## 1. Тема
Обработка матриц
## 2. Цель работы
Составить программу на языке Си, производящуюобработку квадратной матрицы порядка NxN (1≤N≤8), из целых чисел. вводимой из стандартного входного текстового файла.
## 3. Задание (вариант № 4)
Перестановка строк с минимальным и максимальным произведением элементов (с максимальными номерами
соответственно).
## 4. Оборудование:
Процессор: Apple M1
ОП: 8192 МБ
НМД: 512 ГБ  
Монитор: Retina c диагональю 13,3 дюйма разрешение 2560×1600 пикселей (227 пикселей)
## 5. Программное обеспечение:
Операционная система семейства: MacOS 
Система программирования: XCode версия — 
## 6. Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)
```c:/Lab-15/main.c
#include <stdio.h>

int change(int n,int m[n][n],int indmin,int indmax);

int transpose(int n, int m[n][n]);

int main (){
    int n;
    scanf ("%d", &n);
    int m[n][n];
    for(int i=0;i!=n;++i)
        for (int j = 0; j != n; ++j)
            scanf ("%d", &m[i][j]);
    putchar('\n');
    m[n][n]=transpose(n, m);
    for(int i=0;i!=n;++i){
        int counter=0;
        for (int j = 0; j != n; ++j){
            counter++;
            if (counter % n !=0)
                printf("%d ", m[i][j]);
            else
                printf("%d\n", m[i][j]);
        }
    }
    return 0;
}

int change(int n,int m[n][n],int indmin,int indmax){
    for (int(j)=0;j<n;j++){
        int(k)=m[indmin][j];
        m[indmin][j]=m[indmax][j];
        m[indmax][j]=k;
    }
    return m[n][n];
}

int transpose(int n, int m[n][n]){
    int max, min,indmax,indmin,counter=0;
    for (int(i)=0;i<n;i++){
        int prv=1;
        for (int(j)=0;j<n;j++)
            prv=prv*m[i][j];
        if (counter==0){
            max=prv;
            indmax=i;
            min=prv;
            indmax=i;
            counter++;
        }else
            if (max<=prv){
                max=prv;
                indmax=i;}
            if (min>=prv){
                min=prv;
                indmin=i;}
    }
    return change(n, m,indmin,indmax);
}
```

## 7. Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию]. 
• Изучить методы работы с матрицами
• Разобраться с поставленной задачей
• Найти решение с помощью программы на языке С
•	Скомпилировать программу
•	Запустить программу
Пункты 1-7 отчета составляются сторого до начала лабораторной работы.
Допущен к выполнению работы.  
Подпись преподавателя _____________________
## 8. Распечатка протокола 
```
4 1 2 3 4 5 6 7 8 9 11 23 11 45 62 -5
3 4 

1 2 3 4
5 6 7 8
45 62 -5 3
9 11 23 11
Program ended with exit code: 0
```
## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 10.11.22 | 13:00 | Выполнение лабораторной работы | - | - |
## 10. Замечания автора по существу работы — Написание команд для отработки навыков работы в ОС UNIX.
```

```
## 11. Выводы
Были изучены основы работы с компилятором gcc: установка, компиляция, выполнение программ. Было выяснено, что Emacs — наиболее подходящий текстовый редактор для работы со сторонними компиляторами: установка и обозначение проходят быстро, а интегрированная командная строка значительно упрощает работу с программой.

Недочёты при выполнении задания могут быть устранены следующим образом: —

Подпись студента _________________


